cf_billing/Documents/энргЭтапПретензионноИсковойДеятельности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргЭтапПретензионноИсковойДеятельности</Name>
			<BasedOn>
				<xr:Item>Document.энргЭтапПретензионноИсковойДеятельности</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргЭтапыПретензионноИсковойДеятельности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительныйЛистДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительныйЛистНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргЭтапПретензионноИсковойДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодЗадолженностиКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодЗадолженностиНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаГоспошлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПеня</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапПИД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледЭтапа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрекращенаДеятельность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Долги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДолга</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоИсполнительномуЛисту</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУтвержденная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Catalogs/энргВидыОперацийПИД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргВидыОперацийПИД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыЭтапов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргРоли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьПодэтапы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подэтапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подэтап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параллельно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Documents/энргЭтапПретензионноИсковойДеятельности/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
	
	
			
КонецПроцедуры

#КонецОбласти
	
#Область ОбработчикиСобытий

// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ОшибкиПечати          - Список значений  - Ошибки печати  (значение - ссылка на объект, представление - текст ошибки).
//   ОбъектыПечати         - Список значений  - Объекты печати (значение - ссылка на объект, представление - имя области
//												в которой был выведен объект).
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ИмяМакета 					= КоллекцияПечатныхФорм[0].ИмяМакета;
	СинонимМакета 				= КоллекцияПечатныхФорм[0].СинонимМакета;

	Если ИмяМакета ="ПФ_MXL_Предупреждение" тогда 		
		ТабличныйДокумент 		= СформироватьПредупреждение(МассивОбъектов);
	ИначеЕсли ИмяМакета ="ПФ_MXL_Извещение" тогда 		
		ТабличныйДокумент 		= СформироватьИзвещение(МассивОбъектов);		
	ИначеЕсли  ИмяМакета ="ПФ_MXL_Уведомление" тогда 		
		ТабличныйДокумент 		= СформироватьУведомление(МассивОбъектов);		
	КонецЕсли; 	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета) Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
						КоллекцияПечатныхФорм,
						ИмяМакета,СинонимМакета,
						ТабличныйДокумент, ,
						"Документ.энргЭтапПретензионноИсковойДеятельности." + ИмяМакета);
	КонецЕсли;

КонецПроцедуры

Функция СформироватьПредупреждение(МассивОбъектов)
	
	ТабличныйДокумент 						= Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати 	= "ПараметрыПечати_энргЭтапПретензионноИсковойДеятельности_Предупреждение";
	
	ИмяМакета 								= "ПФ_MXL_Предупреждение";
	
	ОбластиМакета = Новый Структура;
	ОбластиМакета.Вставить("Данные");
	ОбластиМакета.Вставить("Адреса");
	ОбластиМакета.Вставить("Подвал");
	
	Макет 									= УправлениеПечатью.МакетПечатнойФормы("Документ.энргЭтапПретензионноИсковойДеятельности." + ИмяМакета);
	
	для Каждого КлючЗначение из ОбластиМакета  цикл
		ОбластиМакета[КлючЗначение.ключ] 	= Макет.получитьОбласть(КлючЗначение.ключ);
	КонецЦикла; 	
			
	ПервыйДокумент = Истина;
	
	для Каждого ОбъектПечати из МассивОбъектов цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		Область 								= ОбластиМакета.Данные;
		Область.Параметры.Абонент 				= ОбъектПечати.Абонент;
		Область.Параметры.Адрес 				= ОбъектПечати.АдресОбъекта;
		Область.Параметры.Поставщик 			= ОбъектПечати.Поставщик;
		Область.Параметры.Сумма 				= ОбъектПечати.СуммаЗадолженности ;
		Область.Параметры.Дата 					= Формат(ОбъектПечати.Дата,"ДЛФ=DD");
		ТабличныйДокумент.Вывести(Область);
				
		Область 								= ОбластиМакета.Адреса;	
		ВывестиАдресаАбонентскихПунктов(Область,ТабличныйДокумент,ОбъектПечати.Поставщик);
						
		Область 								= ОбластиМакета.Подвал;
		ТабличныйДокумент.Вывести(Область);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция СформироватьИзвещение(МассивОбъектов)
	
	ТабличныйДокумент 						= Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати 	= "ПараметрыПечати_энргЭтапПретензионноИсковойДеятельности_Извещение";
	
	ИмяМакета 								= "ПФ_MXL_Извещение";
	
	ОбластиМакета = Новый Структура;
	ОбластиМакета.Вставить("Заголовок");
	ОбластиМакета.Вставить("Данные");
	ОбластиМакета.Вставить("Адреса");
	ОбластиМакета.Вставить("Телефоны");
	ОбластиМакета.Вставить("Подвал");
	
	Макет 									= УправлениеПечатью.МакетПечатнойФормы("Документ.энргЭтапПретензионноИсковойДеятельности." + ИмяМакета);
	
	для Каждого КлючЗначение из ОбластиМакета  цикл
		ОбластиМакета[КлючЗначение.ключ] 	= Макет.получитьОбласть(КлючЗначение.ключ);
	КонецЦикла; 	
	
	ПервыйДокумент = Истина;
	
	для Каждого ОбъектПечати из МассивОбъектов цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
		КонецЕсли;
		ПервыйДокумент = Ложь;   	
		
		ОбластьЗаголовок 						= ОбластиМакета.Заголовок;
		ОбластьЗаголовок.Параметры.Абонент 		= ОбъектПечати.Абонент;
		ОбластьЗаголовок.Параметры.Адрес 		= ОбъектПечати.АдресОбъекта;
		ОбластьЗаголовок.Параметры.Поставщик 	= ОбъектПечати.Поставщик;
		ОбластьЗаголовок.Параметры.Дата 		= Формат(ОбъектПечати.Дата,"ДЛФ=DD");
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);	
		
		ОбластьДанные 							= ОбластиМакета.Данные;
		ОбластьДанные.Параметры.Поставщик 		= ОбъектПечати.Поставщик;
		ОбластьДанные.Параметры.Сумма 			= ОбъектПечати.СуммаЗадолженности ;
		ОбластьДанные.Параметры.Дата 			= Формат(ОбъектПечати.Дата,"ДЛФ=DD");		
		ТабличныйДокумент.Вывести(ОбластьДанные); 		
		
		Область 								= ОбластиМакета.Адреса;	
		ВывестиАдресаАбонентскихПунктов(Область,ТабличныйДокумент,ОбъектПечати.Поставщик);		
			
		ОбластьПодвал 							= ОбластиМакета.Подвал;
		ТабличныйДокумент.Вывести(ОбластьПодвал);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция СформироватьУведомление(МассивОбъектов)
	
	ТабличныйДокумент 							= Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати 		= "ПараметрыПечати_энргЭтапПретензионноИсковойДеятельности_Извещение";
	                                        	
	ИмяМакета 									= "ПФ_MXL_Уведомление";
	
	ОбластиМакета = Новый Структура;
	ОбластиМакета.Вставить("Заголовок");
	ОбластиМакета.Вставить("Данные");
	ОбластиМакета.Вставить("Адреса");
	ОбластиМакета.Вставить("Телефоны");
	ОбластиМакета.Вставить("Подвал");
	
	Макет 										= УправлениеПечатью.МакетПечатнойФормы("Документ.энргЭтапПретензионноИсковойДеятельности." + ИмяМакета);
	
	для Каждого КлючЗначение из ОбластиМакета  цикл
		ОбластиМакета[КлючЗначение.ключ] 		= Макет.получитьОбласть(КлючЗначение.ключ);
	КонецЦикла; 	
	
	ПервыйДокумент 								= Истина;
	
	для Каждого ОбъектПечати из МассивОбъектов цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
		КонецЕсли;
		ПервыйДокумент 							= Ложь;	
		
		ОбластьЗаголовок 						= ОбластиМакета.Заголовок;
		ОбластьЗаголовок.Параметры.Абонент 		= ОбъектПечати.Абонент;
		ОбластьЗаголовок.Параметры.Адрес 		= ОбъектПечати.АдресОбъекта;
		ОбластьЗаголовок.Параметры.Поставщик 	= ОбъектПечати.Поставщик;
		ОбластьЗаголовок.Параметры.Сумма 		= ОбъектПечати.СуммаЗадолженности ;
		ОбластьЗаголовок.Параметры.Дата 		= Формат(ОбъектПечати.Дата,"ДЛФ=DD");
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		ОбластьАдреса 							= ОбластиМакета.Адреса;	
		ТабличныйДокумент.Вывести(ОбластьАдреса);
		
		ОбластьДанные 							= ОбластиМакета.Данные;
		ОбластьДанные.Параметры.Поставщик 		= ОбъектПечати.Поставщик;
		ТабличныйДокумент.Вывести(ОбластьДанные);
		
		Область			 						= ОбластиМакета.Телефоны;
		ВывестиАдресаАбонентскихПунктов(Область,ТабличныйДокумент,ОбъектПечати.Поставщик);
			
		ОбластьПодвал 							= ОбластиМакета.Подвал;
		ТабличныйДокумент.Вывести(ОбластьПодвал);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

// СФормировать Первый этап ПИД.
Функция ПервыйЭтап_ПИД() Экспорт
	
	Запрос  		= Новый Запрос;
	Запрос.Текст 	="ВЫБРАТЬ
	|	МИНИМУМ(энргВидыОперацийПИД.Ссылка) КАК Этап
	|ИЗ
	|	(ВЫБРАТЬ
	|		МИНИМУМ(энргВидыОперацийПИД.Порядок) КАК Порядок
	|	ИЗ
	|		Справочник.энргВидыОперацийПИД КАК энргВидыОперацийПИД
	|	ГДЕ
	|		НЕ энргВидыОперацийПИД.Отключен) КАК ВложенныйЗАпрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыОперацийПИД КАК энргВидыОперацийПИД
	|		ПО ВложенныйЗАпрос.Порядок = энргВидыОперацийПИД.Порядок
	|			И (НЕ энргВидыОперацийПИД.Отключен)";
	Результат  = Запрос.Выполнить();
	Если Результат.Пустой() тогда
		Возврат Справочники.энргВидыОперацийПИД.ПустаяСсылка();
	иначе
		Выборка  = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Этап; 
	КонецЕсли;
	
КонецФункции

Функция ВывестиАдресаАбонентскихПунктов(Область,ТабличныйДокумент,Поставщик)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргКонтрагентыКонтактнаяИнформация.Представление КАК Адрес
	|ИЗ
	|	Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	энргКонтрагентыКонтактнаяИнформация.Ссылка = &Поставщик
	|	И энргКонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресАбонПунктаПоставщикаУслуг)";
	
	Запрос.УстановитьПараметр("Поставщик", 	Поставщик); 	
	Результат 						= Запрос.Выполнить();	
	Выборка 						= Результат.Выбрать();
	Пока Выборка.Следующий() цикл
		 Область.параметры.Адреса 	= Выборка.Адрес;
		 ТабличныйДокумент.вывести(Область);
	КонецЦикла;	
КонецФункции
#КонецОбласти

#КонецЕсли
